app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
   def new
      @comment = Comment.new
      @comment.post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Yvan"], ["body", "lol"], ["created_at", Tue, 24 Apr 2012 19:42:44 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 24 Apr 2012 19:42:44 UTC +00:00]]
---
   def create
      @post = Post.find_by_id(params[:post_id])
      @comment = @post.comments.create(params[:comment])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
   def destroy
      @post = Post.find(params[:id])
      @comment = @post.comments.find(params[:post_id])
      flash[:error] = "Vous venez de supprimer un commentaire sur le post #{@post.title}"
      @comment.destroy