app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Marie est une vilaine vache !"], ["created_at", Sun, 25 Mar 2012 01:54:47 UTC +00:00], ["title", "Une vache"], ["updated_at", Sun, 25 Mar 2012 01:54:47 UTC +00:00]]
---
 def create
    @post = Post.new(params[:post])
    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
---
 def show
    @post = Post.find_by_id(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT 1
---
 def edit
    @post = Post.find_by_id(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "title" = 'Hello', "body" = 'word !', "updated_at" = '2012-03-28 17:57:43.241817' WHERE "posts"."id" = 1
---
 def update
    @post = Post.find(params[:id])

    #if @post.update_attributes(params[:post])
     #  redirect_to @post
    #else
     #  render :action => "edit"
    #end
    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
 def destroy
    @post = Post.find_by_id(params[:id])
    flash[:error] = "Vous venez de supprimer le post #{@post.title}"
    @post.destroy